# InvalidRebarHostWrongCategory Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..InvalidRebarHostWrongCategory Property
BuiltInFailures..::..RebarFailures Class See Also
---
Rebar can't be placed in a family of category [Name].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidRebarHostWrongCategory { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidRebarHostWrongCategory As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidRebarHostWrongCategory {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace